In [50]:
# import required libraries
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sb
import plotly as pty

# now read the dataset
dataset = pd.read_csv('gov_emp_pk.csv')
dataset.head()

   Year Province  Grade  Male Female  Unnamed: 5
0  2010   Punjab      1  8580    488         NaN
1  2010   Punjab      2  5321    465         NaN
2  2010   Punjab      3  1816    155         NaN
3  2010   Punjab      4  1739    735         NaN
4  2010   Punjab      5  3333     53         NaN

#### we can see the dataset that there is an extra column which we need to remove

In [51]:
# remove the last column
dataset = dataset.drop(['Unnamed: 5'], axis=True)
dataset.head()

   Year Province  Grade  Male Female
0  2010   Punjab      1  8580    488
1  2010   Punjab      2  5321    465
2  2010   Punjab      3  1816    155
3  2010   Punjab      4  1739    735
4  2010   Punjab      5  3333     53

#### lets now find out are there any missing values

In [52]:
# find out missing and null values
dataset.isnull().sum()

Year         0
Province     0
Grade        0
Male         0
Female      87
dtype: int64

In [53]:
# determine further information
dataset.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1031 entries, 0 to 1030
Data columns (total 5 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Year      1031 non-null   object
 1   Province  1031 non-null   object
 2   Grade     1031 non-null   int64
 3   Male      1031 non-null   object
 4   Female    944 non-null    object
dtypes: int64(1), object(4)
memory usage: 40.4+ KB

#### now check for the unique values in date column

In [54]:
dataset['Year'].unique()

array(['2010', '2011', '2012', '2013', '2014', '2015', '2016', '2017',
       '2018', '2008-09', '2009-10', '2010-11', '2011-12', '2014-15',
       '2015-16', '2016-17', '2017-18'], dtype=object)

In [55]:
# remove the dates having month
dataset1 = dataset[dataset['Year'] != '2010-11']
dataset1 = dataset1[dataset1['Year'] != '2008-09']
dataset1 = dataset1[dataset1['Year'] != '2009-10']
dataset1 = dataset1[dataset1['Year'] != '2011-12']
dataset1 = dataset1[dataset1['Year'] != '2014-15']
dataset1 = dataset1[dataset1['Year'] != '2015-16']
dataset1 = dataset1[dataset1['Year'] != '2016-17']
dataset1 = dataset1[dataset1['Year'] != '2017-18']

In [56]:
dataset1['Year'].unique()

array(['2010', '2011', '2012', '2013', '2014', '2015', '2016', '2017',
       '2018'], dtype=object)

In [57]:
dataset1.info()

<class 'pandas.core.frame.DataFrame'>
Index: 855 entries, 0 to 854
Data columns (total 5 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Year      855 non-null    object
 1   Province  855 non-null    object
 2   Grade     855 non-null    int64
 3   Male      855 non-null    object
 4   Female    768 non-null    object
dtypes: int64(1), object(4)
memory usage: 40.1+ KB

In [58]:
# now replace the null values with zeros in female column
dataset1['Female'] = dataset1['Female'].fillna(0)

In [60]:
dataset1.info()

<class 'pandas.core.frame.DataFrame'>
Index: 855 entries, 0 to 854
Data columns (total 5 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Year      855 non-null    object
 1   Province  855 non-null    object
 2   Grade     855 non-null    int64
 3   Male      855 non-null    object
 4   Female    855 non-null    object
dtypes: int64(1), object(4)
memory usage: 40.1+ KB

In [65]:
# now lets change the data types of male and female columns
dataset1['Male'] = dataset1['Male'].str.replace(',', '', regex = True).astype(int)

In [68]:
dataset1["Female"] = dataset["Female"].str.replace(',', '', regex = True).fillna('0').astype(int)